sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/example/IAR/startup_s6e2cc.s
                PUBWEAK FRT2_ZERO_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
FRT2_ZERO_IRQHandler
                B       FRT2_ZERO_IRQHandler


                PUBWEAK ICU2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
ICU2_IRQHandler
                B       ICU2_IRQHandler


                PUBWEAK OCU2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
OCU2_IRQHandler
                B       OCU2_IRQHandler


                PUBWEAK PPG00_02_04_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
PPG00_02_04_IRQHandler
                B       PPG00_02_04_IRQHandler


                PUBWEAK PPG08_10_12_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
PPG08_10_12_IRQHandler
                B       PPG08_10_12_IRQHandler


                PUBWEAK PPG16_18_20_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
PPG16_18_20_IRQHandler
                B       PPG16_18_20_IRQHandler


                PUBWEAK BT0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT0_IRQHandler
                B       BT0_IRQHandler


                PUBWEAK BT1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT1_IRQHandler
                B       BT1_IRQHandler


                PUBWEAK BT2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT2_IRQHandler
                B       BT2_IRQHandler


                PUBWEAK BT3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT3_IRQHandler
                B       BT3_IRQHandler


                PUBWEAK BT4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT4_IRQHandler
                B       BT4_IRQHandler


                PUBWEAK BT5_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT5_IRQHandler
                B       BT5_IRQHandler


                PUBWEAK BT6_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT6_IRQHandler
                B       BT6_IRQHandler


                PUBWEAK BT7_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT7_IRQHandler
                B       BT7_IRQHandler


                PUBWEAK DT1_2_IRAHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DT1_2_IRAHandler
                B       DT1_2_IRAHandler


                PUBWEAK WC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
WC_IRQHandler
                B       WC_IRQHandler


                PUBWEAK EXTBUS_ERR_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXTBUS_ERR_Handler
                B       EXTBUS_ERR_Handler


                PUBWEAK RTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
RTC_IRQHandler
                B       RTC_IRQHandler


                PUBWEAK EXTINT8_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXTINT8_IRQHandler
                B       EXTINT8_IRQHandler


                PUBWEAK EXTINT9_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXTINT9_IRQHandler
                B       EXTINT9_IRQHandler


                PUBWEAK EXTINT10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXTINT10_IRQHandler
                B       EXTINT10_IRQHandler


                PUBWEAK EXTINT11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXTINT11_IRQHandler
                B       EXTINT11_IRQHandler


                PUBWEAK EXTINT12_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXTINT12_IRQHandler
                B       EXTINT12_IRQHandler


                PUBWEAK EXTINT13_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXTINT13_IRQHandler
                B       EXTINT13_IRQHandler


                PUBWEAK EXTINT14_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXTINT14_IRQHandler
                B       EXTINT14_IRQHandler


                PUBWEAK EXTINT15_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXTINT15_IRQHandler
                B       EXTINT15_IRQHandler


                PUBWEAK TIM_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
TIM_IRQHandler
                B       TIM_IRQHandler


                PUBWEAK MFS0_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS0_RX_IRQHandler
                B       MFS0_RX_IRQHandler


                PUBWEAK MFS0_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS0_TX_IRQHandler
                B       MFS0_TX_IRQHandler


                PUBWEAK MFS1_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS1_RX_IRQHandler
                B       MFS1_RX_IRQHandler


                PUBWEAK MFS1_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS1_TX_IRQHandler
                B       MFS1_TX_IRQHandler


                PUBWEAK MFS2_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS2_RX_IRQHandler
                B       MFS2_RX_IRQHandler


                PUBWEAK MFS2_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS2_TX_IRQHandler
                B       MFS2_TX_IRQHandler


                PUBWEAK MFS3_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS3_RX_IRQHandler
                B       MFS3_RX_IRQHandler


                PUBWEAK MFS3_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS3_TX_IRQHandler
                B       MFS3_TX_IRQHandler


                PUBWEAK MFS4_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS4_RX_IRQHandler
                B       MFS4_RX_IRQHandler


                PUBWEAK MFS4_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS4_TX_IRQHandler
                B       MFS4_TX_IRQHandler


                PUBWEAK MFS5_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS5_RX_IRQHandler
                B       MFS5_RX_IRQHandler


                PUBWEAK MFS5_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS5_TX_IRQHandler
                B       MFS5_TX_IRQHandler


                PUBWEAK MFS6_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS6_RX_IRQHandler
                B       MFS6_RX_IRQHandler


                PUBWEAK MFS6_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS6_TX_IRQHandler
                B       MFS6_TX_IRQHandler


                PUBWEAK MFS7_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS7_RX_IRQHandler
                B       MFS7_RX_IRQHandler


                PUBWEAK MFS7_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS7_TX_IRQHandler
                B       MFS7_TX_IRQHandler


                PUBWEAK ADC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
ADC0_IRQHandler
                B       ADC0_IRQHandler


