sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/example/IAR/startup_s6e2cc.s
                PUBWEAK ADC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
ADC1_IRQHandler
                B       ADC1_IRQHandler


                PUBWEAK USB0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
USB0_IRQHandler
                B       USB0_IRQHandler


                PUBWEAK USB0_HOST_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
USB0_HOST_IRQHandler
                B       USB0_HOST_IRQHandler


                PUBWEAK CAN0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
CAN0_IRQHandler
                B       CAN0_IRQHandler


                PUBWEAK CAN1_CANFD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
CAN1_CANFD_IRQHandler
                B       CAN1_CANFD_IRQHandler


                PUBWEAK ETHER0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
ETHER0_IRQHandler
                B       ETHER0_IRQHandler


                PUBWEAK DMAC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC0_IRQHandler
                B       DMAC0_IRQHandler


                PUBWEAK DMAC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC1_IRQHandler
                B       DMAC1_IRQHandler


                PUBWEAK DMAC2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC2_IRQHandler
                B       DMAC2_IRQHandler


                PUBWEAK DMAC3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC3_IRQHandler
                B       DMAC3_IRQHandler


                PUBWEAK DMAC4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC4_IRQHandler
                B       DMAC4_IRQHandler


                PUBWEAK DMAC5_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC5_IRQHandler
                B       DMAC5_IRQHandler


                PUBWEAK DMAC6_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC6_IRQHandler
                B       DMAC6_IRQHandler


                PUBWEAK DMAC7_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC7_IRQHandler
                B       DMAC7_IRQHandler


                PUBWEAK DSTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DSTC_IRQHandler
                B       DSTC_IRQHandler


                PUBWEAK EXINT16_17_18_19_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT16_17_18_19_IRQHandler
                B       EXINT16_17_18_19_IRQHandler


                PUBWEAK EXINT20_21_22_23_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT20_21_22_23_IRQHandler
                B       EXINT20_21_22_23_IRQHandler


                PUBWEAK EXINT24_25_26_27_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT24_25_26_27_IRQHandler
                B       EXINT24_25_26_27_IRQHandler


                PUBWEAK EXINT28_29_30_31_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT28_29_30_31_IRQHandler
                B       EXINT28_29_30_31_IRQHandler


                PUBWEAK QPRC2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
QPRC2_IRQHandler
                B       QPRC2_IRQHandler


                PUBWEAK QPRC3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
QPRC3_IRQHandler
                B       QPRC3_IRQHandler


                PUBWEAK BT8_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT8_IRQHandler
                B       BT8_IRQHandler


                PUBWEAK BT9_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT9_IRQHandler
                B       BT9_IRQHandler


                PUBWEAK BT10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT10_IRQHandler
                B       BT10_IRQHandler


                PUBWEAK BT11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT11_IRQHandler
                B       BT11_IRQHandler


                PUBWEAK BT12_15_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT12_15_IRQHandler
                B       BT12_15_IRQHandler


                PUBWEAK MFS8_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS8_RX_IRQHandler
                B       MFS8_RX_IRQHandler


                PUBWEAK MFS8_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS8_TX_IRQHandler
                B       MFS8_TX_IRQHandler


                PUBWEAK MFS9_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS9_RX_IRQHandler
                B       MFS9_RX_IRQHandler


                PUBWEAK MFS9_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS9_TX_IRQHandler
                B       MFS9_TX_IRQHandler


                PUBWEAK MFS10_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS10_RX_IRQHandler
                B       MFS10_RX_IRQHandler


                PUBWEAK MFS10_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS10_TX_IRQHandler
                B       MFS10_TX_IRQHandler


                PUBWEAK MFS11_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS11_RX_IRQHandler
                B       MFS11_RX_IRQHandler


                PUBWEAK MFS11_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS11_TX_IRQHandler
                B       MFS11_TX_IRQHandler


                PUBWEAK ADC2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
ADC2_IRQHandler
                B       ADC2_IRQHandler


                PUBWEAK USB1_HDMICEC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
USB1_HDMICEC0_IRQHandler
                B       USB1_HDMICEC0_IRQHandler


                PUBWEAK USB1_HOST_HDMICEC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
USB1_HOST_HDMICEC1_IRQHandler
                B       USB1_HOST_HDMICEC1_IRQHandler


                PUBWEAK HS_QSPI_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
HS_QSPI_IRQHandler
                B       HS_QSPI_IRQHandler


                PUBWEAK PRGCRC_I2S_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
PRGCRC_I2S_IRQHandler
                B       PRGCRC_I2S_IRQHandler


