sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/example/IAR/startup_s6e2cc.s
                PUBWEAK SD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
SD_IRQHandler
                B       SD_IRQHandler


                PUBWEAK FLASHIF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
FLASHIF_IRQHandler
                B       FLASHIF_IRQHandler


                PUBWEAK MFS12_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS12_RX_IRQHandler
                B       MFS12_RX_IRQHandler


                PUBWEAK MFS12_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS12_TX_IRQHandler
                B       MFS12_TX_IRQHandler


                PUBWEAK MFS13_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS13_RX_IRQHandler
                B       MFS13_RX_IRQHandler


                PUBWEAK MFS13_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS13_TX_IRQHandler
                B       MFS13_TX_IRQHandler


                PUBWEAK MFS14_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS14_RX_IRQHandler
                B       MFS14_RX_IRQHandler


                PUBWEAK MFS14_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS14_TX_IRQHandler
                B       MFS14_TX_IRQHandler


                PUBWEAK MFS15_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS15_RX_IRQHandler
                B       MFS15_RX_IRQHandler


                PUBWEAK MFS15_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS15_TX_IRQHandler
                B       MFS15_TX_IRQHandler


                PUBWEAK Dummy
                SECTION .text:CODE:REORDER:NOROOT(1)
Dummy
                B       Dummy

                END
